Masmiseim36/nxpSDK/boards/mimxrt700evk/display_examples/fbdev_freertos/cm33_core0/pin_mux.c
    const uint32_t port2_pin13_config = (/* Pin is configured as FLEXIO_D13 */
                                         IOPCTL_PIO_FUNC5 |
                                         /* Enable pull-up / pull-down function */
                                         IOPCTL_PIO_PUPD_EN |
                                         /* Enable pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |
                                         /* Enables input buffer function */
                                         IOPCTL_PIO_INBUF_EN |
                                         /* Slow mode */
                                         IOPCTL_PIO_SLEW_RATE_SLOW |
                                         /* Analog mux is disabled */
                                         IOPCTL_PIO_ANAMUX_DI |
                                         /* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |
                                         /* Input function is not inverted */
                                         IOPCTL_PIO_INV_DI);
    /* PORT2 PIN13 (coords: E4) is configured as FLEXIO_D13 */
    IOPCTL_PinMuxSet(2U, 13U, port2_pin13_config);

    const uint32_t port2_pin15_config = (/* Pin is configured as PIO2_15 */
                                         IOPCTL_PIO_FUNC0 |
                                         /* Disable pull-up / pull-down function */
                                         IOPCTL_PIO_PUPD_DI |
                                         /* Enable pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |
                                         /* Disable input buffer function */
                                         IOPCTL_PIO_INBUF_DI |
                                         /* Normal mode */
                                         IOPCTL_PIO_SLEW_RATE_NORMAL |
                                         /* Analog mux is disabled */
                                         IOPCTL_PIO_ANAMUX_DI |
                                         /* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |
                                         /* Input function is not inverted */
                                         IOPCTL_PIO_INV_DI);
    /* PORT2 PIN15 (coords: D3) is configured as PIO2_15 */
    IOPCTL_PinMuxSet(2U, 15U, port2_pin15_config);

    const uint32_t port2_pin3_config = (/* Pin is configured as FLEXIO_D3 */
                                        IOPCTL_PIO_FUNC5 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Disable input buffer function */
                                        IOPCTL_PIO_INBUF_DI |
                                        /* Normal mode */
                                        IOPCTL_PIO_SLEW_RATE_NORMAL |
                                        /* Analog mux is disabled */
                                        IOPCTL_PIO_ANAMUX_DI |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI);
    /* PORT2 PIN3 (coords: G1) is configured as FLEXIO_D3 */
    IOPCTL_PinMuxSet(2U, 3U, port2_pin3_config);

    const uint32_t port2_pin4_config = (/* Pin is configured as FLEXIO_D4 */
                                        IOPCTL_PIO_FUNC5 |
                                        /* Enable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_EN |
                                        /* Enable pull-up function */
                                        IOPCTL_PIO_PULLUP_EN |
                                        /* Enables input buffer function */
                                        IOPCTL_PIO_INBUF_EN |
                                        /* Slow mode */
                                        IOPCTL_PIO_SLEW_RATE_SLOW |
                                        /* Analog mux is disabled */
                                        IOPCTL_PIO_ANAMUX_DI |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI);
    /* PORT2 PIN4 (coords: G3) is configured as FLEXIO_D4 */
    IOPCTL_PinMuxSet(2U, 4U, port2_pin4_config);

    const uint32_t port2_pin6_config = (/* Pin is configured as FLEXIO_D6 */
                                        IOPCTL_PIO_FUNC5 |
                                        /* Enable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_EN |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Enables input buffer function */
                                        IOPCTL_PIO_INBUF_EN |
                                        /* Slow mode */
                                        IOPCTL_PIO_SLEW_RATE_SLOW |
                                        /* Analog mux is disabled */
                                        IOPCTL_PIO_ANAMUX_DI |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI);
    /* PORT2 PIN6 (coords: H6) is configured as FLEXIO_D6 */
    IOPCTL_PinMuxSet(2U, 6U, port2_pin6_config);

    const uint32_t port2_pin7_config = (/* Pin is configured as FLEXIO_D7 */
                                        IOPCTL_PIO_FUNC5 |
                                        /* Enable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_EN |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Enables input buffer function */
                                        IOPCTL_PIO_INBUF_EN |
                                        /* Slow mode */
                                        IOPCTL_PIO_SLEW_RATE_SLOW |
                                        /* Analog mux is disabled */
                                        IOPCTL_PIO_ANAMUX_DI |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI);
    /* PORT2 PIN7 (coords: G6) is configured as FLEXIO_D7 */
    IOPCTL_PinMuxSet(2U, 7U, port2_pin7_config);

    const uint32_t port2_pin8_config = (/* Pin is configured as FLEXIO_D8 */
                                        IOPCTL_PIO_FUNC5 |
                                        /* Enable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_EN |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Enables input buffer function */
                                        IOPCTL_PIO_INBUF_EN |
                                        /* Slow mode */
                                        IOPCTL_PIO_SLEW_RATE_SLOW |
                                        /* Analog mux is disabled */
                                        IOPCTL_PIO_ANAMUX_DI |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI);
    /* PORT2 PIN8 (coords: G4) is configured as FLEXIO_D8 */
    IOPCTL_PinMuxSet(2U, 8U, port2_pin8_config);

    const uint32_t port2_pin9_config = (/* Pin is configured as FLEXIO_D9 */
                                        IOPCTL_PIO_FUNC5 |
                                        /* Enable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_EN |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Enables input buffer function */
                                        IOPCTL_PIO_INBUF_EN |
                                        /* Slow mode */
                                        IOPCTL_PIO_SLEW_RATE_SLOW |
                                        /* Analog mux is disabled */
                                        IOPCTL_PIO_ANAMUX_DI |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI);
    /* PORT2 PIN9 (coords: G5) is configured as FLEXIO_D9 */
    IOPCTL_PinMuxSet(2U, 9U, port2_pin9_config);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLcdDBIPanelPins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: D3, peripheral: GPIO2, signal: 'GPIO, 15', pin_signal: PIO2_15/EZH_PIO15/FLEXIO_D15/CLKCTL0_LOW_FREQ_CLKOUT_N, direction: OUTPUT}
  - {pin_num: H6, peripheral: LCDIF, signal: 'DBI_DATA, 0', pin_signal: PIO2_6/LPSPI16_PCS3/FLEXIO_D6/LCD_DATA0/LCD_DBI_DATA0, pull_select: up, pull_enable: enable}
  - {pin_num: G6, peripheral: LCDIF, signal: 'DBI_DATA, 1', pin_signal: PIO2_7/LPSPI16_PCS2/EZH_PIO7/FLEXIO_D7/LCD_D1/LCD_DBI_D1, pull_select: up, pull_enable: enable}
  - {pin_num: G4, peripheral: LCDIF, signal: 'DBI_DATA, 2', pin_signal: PIO2_8/LPSPI16_PCS1/EZH_PIO8/FLEXIO_D8/LCD_D2/LCD_DBI_D2, pull_select: up, pull_enable: enable}
  - {pin_num: G5, peripheral: LCDIF, signal: 'DBI_DATA, 3', pin_signal: PIO2_9/EZH_PIO9/FLEXIO_D9/LCD_D3/LCD_DBI_D3, pull_select: up, pull_enable: enable}
  - {pin_num: F5, peripheral: LCDIF, signal: 'DBI_DATA, 4', pin_signal: PIO2_10/EZH_PIO10/FLEXIO_D10/LCD_D4/LCD_DBI_D4, pull_select: up, pull_enable: enable}
  - {pin_num: F3, peripheral: LCDIF, signal: 'DBI_DATA, 5', pin_signal: PIO2_11/EZH_PIO11/FLEXIO_D11/LCD_D5/LCD_DBI_D5, pull_select: up, pull_enable: enable}
  - {pin_num: E3, peripheral: LCDIF, signal: 'DBI_DATA, 6', pin_signal: PIO2_12/EZH_PIO12/FLEXIO_D12/LCD_D6/LCD_DBI_D6, pull_select: up, pull_enable: enable}
  - {pin_num: E4, peripheral: LCDIF, signal: 'DBI_DATA, 7', pin_signal: PIO2_13/EZH_PIO13/FLEXIO_D13/LCD_D7/LCD_DBI_D7, pull_select: up, pull_enable: enable}
  - {pin_num: G1, peripheral: LCDIF, signal: RWDX, pin_signal: PIO2_3/LPSPI16_SCK/EZH_PIO3/FLEXIO_D3/LCD_DOTCLK/LCD_DBI_RWDX, slew_rate: slow, input_buffer: disable,
    pull_select: up, pull_enable: disable}
  - {pin_num: G3, peripheral: LCDIF, signal: WRX, pin_signal: PIO2_4/LPSPI16_SIN/EZH_PIO4/FLEXIO_D4/LCD_HSYNC/LCD_DBI_WRX, slew_rate: standard, input_buffer: disable,
    pull_select: up, pull_enable: disable}
  - {pin_num: H2, peripheral: LCDIF, signal: CSX, pin_signal: PIO2_0/USB0_OVERCURRENTN/EZH_PIO0/FLEXIO_D0/LCD_DBI_CSX_AB, slew_rate: standard, input_buffer: disable,
    pull_select: up, pull_enable: disable}
  - {pin_num: G2, peripheral: LCDIF, signal: DSX, pin_signal: PIO2_1/USB0_PORTPWRN/EZH_PIO1/FLEXIO_D1/LCD_DBI_DCX_AB, slew_rate: slow, input_buffer: disable, pull_select: up,
    pull_enable: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

