Masmiseim36/nxpSDK/boards/mimxrt700evk/display_examples/fbdev_freertos/cm33_core0/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPmicPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitPmicPins(void)
{
    /* Reset IOPCTL1 module */
    RESET_ClearPeripheralReset(kIOPCTL1_RST_SHIFT_RSTn);

    IOPCTL1->PMIC_I2C_SCL = ((IOPCTL1->PMIC_I2C_SCL &
                              /* Mask bits to zero which are setting */
                              (~(IOPCTL1_PMIC_I2C_SCL_IBENA_MASK | IOPCTL1_PMIC_I2C_SCL_ODENA_MASK)))

                             /* Input Buffer Enable: Enables */
                             | IOPCTL1_PMIC_I2C_SCL_IBENA(PMIC_I2C_SCL_IBENA_IBENA_1)

                             /* Open-drain Mode Enable: Enables for simulated open-drain output (high drive disabled) */
                             | IOPCTL1_PMIC_I2C_SCL_ODENA(PMIC_I2C_SCL_ODENA_ODENA_1));

    IOPCTL1->PMIC_I2C_SDA = ((IOPCTL1->PMIC_I2C_SDA &
                              /* Mask bits to zero which are setting */
                              (~(IOPCTL1_PMIC_I2C_SDA_IBENA_MASK | IOPCTL1_PMIC_I2C_SDA_ODENA_MASK)))

                             /* Input Buffer Enable: Enables */
                             | IOPCTL1_PMIC_I2C_SDA_IBENA(PMIC_I2C_SDA_IBENA_IBENA_1)

                             /* Open-drain Mode Enable: Enables for simulated open-drain output (high drive disabled) */
                             | IOPCTL1_PMIC_I2C_SDA_ODENA(PMIC_I2C_SDA_ODENA_ODENA_1));
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
